[NoCoverage] ObjectLiteral
ngmidlevelabstraction/src/app/app.component.ts:13:40
   formGroup: FormGroup;
 
   constructor(private readonly formBuilder: FormBuilder) {
-    this.formGroup = formBuilder.group({
-      fullName: ['', Validators.required],
-      bachelorPeriod: ['', Validators.required],
-      militaryServicePeriod: ['', Validators.required],
-      dastan: [{value: null, disabled: true}, Validators.required],
-    })
+    this.formGroup = formBuilder.group({})
   }
 

[NoCoverage] StringLiteral
ngmidlevelabstraction/src/app/app.component.ts:14:18
 
   constructor(private readonly formBuilder: FormBuilder) {
     this.formGroup = formBuilder.group({
-      fullName: ['', Validators.required],
+      fullName: ["Stryker was here!", Validators.required],
       bachelorPeriod: ['', Validators.required],
       militaryServicePeriod: ['', Validators.required],

[NoCoverage] BooleanLiteral
ngmidlevelabstraction/src/app/app.component.ts:17:40
       fullName: ['', Validators.required],
       bachelorPeriod: ['', Validators.required],
       militaryServicePeriod: ['', Validators.required],
-      dastan: [{value: null, disabled: true}, Validators.required],
+      dastan: [{value: null, disabled: false}, Validators.required],
     })
   }

[NoCoverage] BlockStatement
ngmidlevelabstraction/src/app/app.component.ts:21:20
     })
   }
 
-  ngOnInit(): void {
-    this.formGroup.valueChanges.subscribe(console.log)
-
-    setTimeout(() => {
-      this.formGroup.controls['dastan'].enable();
-    }, 2000)
-  }
+  ngOnInit(): void {}
 
 }

[NoCoverage] BlockStatement
ngmidlevelabstraction/src/app/app.component.ts:24:22
   ngOnInit(): void {
     this.formGroup.valueChanges.subscribe(console.log)
 
-    setTimeout(() => {
-      this.formGroup.controls['dastan'].enable();
-    }, 2000)
+    setTimeout(() => {}, 2000)
   }
 

[NoCoverage] StringLiteral
ngmidlevelabstraction/src/app/app.component.ts:25:31
     this.formGroup.valueChanges.subscribe(console.log)
 
     setTimeout(() => {
-      this.formGroup.controls['dastan'].enable();
+      this.formGroup.controls[""].enable();
     }, 2000)
   }
