[Survived] BooleanLiteral
app/components/form/CustomFormGroup.ts:9:20
   };
   public onTouched = () => {
   };
-  public touched = false;
+  public touched = true;
 
   protected constructor() {

[Survived] BlockStatement
app/components/form/CustomFormGroup.ts:11:27
   };
   public touched = false;
 
-  protected constructor() {
-    this.initOnChange();
-  }
+  protected constructor() {}
 
   private initOnChange(): void {

[Survived] BlockStatement
app/components/form/CustomFormGroup.ts:15:32
     this.initOnChange();
   }
 
-  private initOnChange(): void {
-    this.formGroup.valueChanges.subscribe((value) => {
-      this.onChange(value);
-      this.markAsTouched();
-    })
-  }
+  private initOnChange(): void {}
 
   private markAsTouched() {

[Survived] BlockStatement
app/components/form/CustomFormGroup.ts:16:54
   }
 
   private initOnChange(): void {
-    this.formGroup.valueChanges.subscribe((value) => {
-      this.onChange(value);
-      this.markAsTouched();
-    })
+    this.formGroup.valueChanges.subscribe((value) => {})
   }
 

[Survived] BlockStatement
app/components/form/CustomFormGroup.ts:22:27
     })
   }
 
-  private markAsTouched() {
-    if (!this.touched) {
-      this.onTouched();
-      this.touched = true;
-    }
-  }
+  private markAsTouched() {}
 
   registerOnChange(fn: any): void {

[Survived] ConditionalExpression
app/components/form/CustomFormGroup.ts:23:9
   }
 
   private markAsTouched() {
-    if (!this.touched) {
+    if (false) {
       this.onTouched();
       this.touched = true;

[Survived] ConditionalExpression
app/components/form/CustomFormGroup.ts:23:9
   }
 
   private markAsTouched() {
-    if (!this.touched) {
+    if (true) {
       this.onTouched();
       this.touched = true;

[Survived] BooleanLiteral
app/components/form/CustomFormGroup.ts:25:22
   private markAsTouched() {
     if (!this.touched) {
       this.onTouched();
-      this.touched = true;
+      this.touched = false;
     }
   }

[NoCoverage] BlockStatement
app/components/form/CustomFormGroup.ts:29:35
     }
   }
 
-  registerOnChange(fn: any): void {
-    this.onChange = fn;
-  }
+  registerOnChange(fn: any): void {}
 
   registerOnTouched(fn: any): void {

[NoCoverage] BlockStatement
app/components/form/CustomFormGroup.ts:33:36
     this.onChange = fn;
   }
 
-  registerOnTouched(fn: any): void {
-    this.onTouched = fn;
-  }
+  registerOnTouched(fn: any): void {}
 
   writeValue(obj: any): void {

[NoCoverage] BlockStatement
app/components/form/CustomFormGroup.ts:37:30
     this.onTouched = fn;
   }
 
-  writeValue(obj: any): void {
-    this.formGroup.patchValue(obj || '');
-  }
+  writeValue(obj: any): void {}
 }
 

[NoCoverage] LogicalOperator
app/components/form/CustomFormGroup.ts:38:31
   }
 
   writeValue(obj: any): void {
-    this.formGroup.patchValue(obj || '');
+    this.formGroup.patchValue(obj && '');
   }
 }
