[Survived] BlockStatement
app/components/form/CustomFormGroupDecorator.ts:13:54
     this.assignNewFormControl(formControlName);
   }
 
-  protected assignNewFormControl(name: string): void {
-    this.customFormGroup.formGroup.setControl(name, new FormControl(''))
-  }
+  protected assignNewFormControl(name: string): void {}
 }
 
