[NoCoverage] StringLiteral
components/form/double-text/double-text.component.ts:21:37
 export class DoubleTextComponent extends CustomFormGroup implements ControlValueAccessor {
   constructor() {
     super();
-    new ConcreteTextDecorator(this, 'firstname');
+    new ConcreteTextDecorator(this, "");
     new ConcreteTextDecorator(this, 'lastname');
     new ConcreteTextDecorator(this, 'suffix');

[NoCoverage] StringLiteral
components/form/double-text/double-text.component.ts:23:37
     super();
     new ConcreteTextDecorator(this, 'firstname');
     new ConcreteTextDecorator(this, 'lastname');
-    new ConcreteTextDecorator(this, 'suffix');
+    new ConcreteTextDecorator(this, "");
   }
 }
