[Survived] StringLiteral
components/form/range-picker/range-picker.component.ts:23:37
   constructor() {
     super();
     new ConcreteTextDecorator(this, 'from');
-    new ConcreteTextDecorator(this, 'to');
+    new ConcreteTextDecorator(this, "");
   }
 }
