[Killed] BlockStatement
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:1:47
-export function isObjectEmpty(object: Object) {
-  for (const value of Object.values(object)) {
-    if (!!value) {
-      return false
-    }
-  }
-  return true;
-}
+export function isObjectEmpty(object: Object) {}
 
killedBy: isObjectEmpty shouldn't return undefined
statusReason: Error: Expected undefined to be defined.

[Killed] BlockStatement
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:2:46
 export function isObjectEmpty(object: Object) {
-  for (const value of Object.values(object)) {
-    if (!!value) {
-      return false
-    }
-  }
+  for (const value of Object.values(object)) {}
   return true;
 }
killedBy: isObjectEmpty should return false with object that has some values
statusReason: Error: Expected true to be false.

[Killed] BlockStatement
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:3:18
 export function isObjectEmpty(object: Object) {
   for (const value of Object.values(object)) {
-    if (!!value) {
-      return false
-    }
+    if (!!value) {}
   }
   return true;
killedBy: isObjectEmpty should return false with object that has some values
statusReason: Error: Expected true to be false.

[Killed] ConditionalExpression
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:3:9
 export function isObjectEmpty(object: Object) {
   for (const value of Object.values(object)) {
-    if (!!value) {
+    if (true) {
       return false
     }
killedBy: isObjectEmpty should return true with object with keys and noe values
statusReason: Error: Expected false to be true.

[Killed] BooleanLiteral
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:4:14
 export function isObjectEmpty(object: Object) {
   for (const value of Object.values(object)) {
     if (!!value) {
-      return false
+      return true
     }
   }
killedBy: isObjectEmpty should return false with object that has some values
statusReason: Error: Expected true to be false.
