[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:13:42
     return this._form;
   }
 
-  protected set form(newForm: FormGroup) {
-    this._form = newForm;
-    this.callRegisteredFunctions();
-  }
+  protected set form(newForm: FormGroup) {}
 
   public touched = false;

[Survived] BooleanLiteral
src/app/v2/FormControlAdapter.ts:18:20
     this.callRegisteredFunctions();
   }
 
-  public touched = false;
+  public touched = true;
   private onChange = (value: object) => {
   };

[Survived] BlockStatement
src/app/v2/FormControlAdapter.ts:29:43
     this.callRegisteredFunctions();
   }
 
-  private callRegisteredFunctions(): void {
-    this.form.valueChanges.pipe(takeUntil(this.subscribeAll)).subscribe((value) => {
-      this.onChange(value);
-      this.markAsTouched();
-    })
-  }
+  private callRegisteredFunctions(): void {}
 
   private markAsTouched() {

[Survived] BlockStatement
src/app/v2/FormControlAdapter.ts:30:84
   }
 
   private callRegisteredFunctions(): void {
-    this.form.valueChanges.pipe(takeUntil(this.subscribeAll)).subscribe((value) => {
-      this.onChange(value);
-      this.markAsTouched();
-    })
+    this.form.valueChanges.pipe(takeUntil(this.subscribeAll)).subscribe((value) => {})
   }
 

[Survived] BooleanLiteral
src/app/v2/FormControlAdapter.ts:37:9
   }
 
   private markAsTouched() {
-    if (!this.touched) {
+    if (this.touched) {
       this.onTouched();
       this.touched = true;

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:43:57
     }
   }
 
-  registerOnChange(callbackFunction: () => never): void {
-    this.onChange = callbackFunction;
-  }
+  registerOnChange(callbackFunction: () => never): void {}
 
   registerOnTouched(callbackFunction: () => never): void {

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:47:58
     this.onChange = callbackFunction;
   }
 
-  registerOnTouched(callbackFunction: () => never): void {
-    this.onTouched = callbackFunction;
-  }
+  registerOnTouched(callbackFunction: () => never): void {}
 
   writeValue(value: object): void {

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:51:35
     this.onTouched = callbackFunction;
   }
 
-  writeValue(value: object): void {
-    this.form.patchValue(value || {});
-  }
+  writeValue(value: object): void {}
 
   setDisabledState(isDisabled: boolean) {

[NoCoverage] LogicalOperator
src/app/v2/FormControlAdapter.ts:52:26
   }
 
   writeValue(value: object): void {
-    this.form.patchValue(value || {});
+    this.form.patchValue(value && {});
   }
 

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:55:41
     this.form.patchValue(value || {});
   }
 
-  setDisabledState(isDisabled: boolean) {
-    if (isDisabled) {
-      this.form.disable();
-    } else {
-      this.form.enable();
-    }
-  }
+  setDisabledState(isDisabled: boolean) {}
 
   ngOnDestroy(): void {

[NoCoverage] ConditionalExpression
src/app/v2/FormControlAdapter.ts:56:9
   }
 
   setDisabledState(isDisabled: boolean) {
-    if (isDisabled) {
+    if (false) {
       this.form.disable();
     } else {

[NoCoverage] ConditionalExpression
src/app/v2/FormControlAdapter.ts:56:9
   }
 
   setDisabledState(isDisabled: boolean) {
-    if (isDisabled) {
+    if (true) {
       this.form.disable();
     } else {

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:58:12
   setDisabledState(isDisabled: boolean) {
     if (isDisabled) {
       this.form.disable();
-    } else {
-      this.form.enable();
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/app/v2/FormControlAdapter.ts:63:23
     }
   }
 
-  ngOnDestroy(): void {
-    this.subscribeAll.next(null);
-    this.subscribeAll.complete();
-  };
+  ngOnDestroy(): void {};
 }
 
