[Survived] UpdateOperator
src/app/v2/MatFormFieldAdapter.ts:18:12
 
   private static createdCounter = 0;
   private static increaseCreateCounter(): number {
-    return MatFormFieldAdapter.createdCounter++;
+    return MatFormFieldAdapter.createdCounter--;
   }
   @HostBinding() readonly id = `${this.controlType}-${MatFormFieldAdapter.increaseCreateCounter()}`;

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:28:23
     return this.form.value;
   }
 
-  set value(value: T) {
-    this.form.patchValue(value);
-    this.stateChanges.next();
-  }
+  set value(value: T) {}
 
   // todo(med): make placeholder accept objects instead of a string
killedBy: MatFormFieldAdapter should have FormControlAdapter.form.value change when setting value
statusReason: Expected $.dummy = '' to equal 'dummy-text'.
Expected $.dummy2 = '' to equal 'dummy-text'.
Error: Expected $.dummy = '' to equal 'dummy-text'.
Expected $.dummy2 = '' to equal 'dummy-text'.

[NoCoverage] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:40:32
     return this._placeholder;
   }
 
-  set placeholder(placeholder) {
-    this._placeholder = placeholder;
-    this.stateChanges.next();
-  }
+  set placeholder(placeholder) {}
 
   focused = false;

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:45:13
     this.stateChanges.next();
   }
 
-  focused = false;
+  focused = true;
 
   get empty() {
killedBy: MatFormFieldAdapter should have a shouldLabelFloat property and it should be false by default
statusReason: Error: Expected true to be false.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:48:57
   focused = false;
 
   get empty() {
-    for (const value of Object.values(this.form.value)) {
-      if (!!value) {
-        return false
-      }
-    }
+    for (const value of Object.values(this.form.value)) {}
     return true;
   }
killedBy: MatFormFieldAdapter should have empty as false if value is not empty
statusReason: Error: Expected true to be false.

[Killed] ConditionalExpression
src/app/v2/MatFormFieldAdapter.ts:49:11
 
   get empty() {
     for (const value of Object.values(this.form.value)) {
-      if (!!value) {
+      if (true) {
         return false
       }
killedBy: MatFormFieldAdapter should have empty as true by default
statusReason: Error: Expected false to be true.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:49:12
 
   get empty() {
     for (const value of Object.values(this.form.value)) {
-      if (!!value) {
+      if (!value) {
         return false
       }
killedBy: MatFormFieldAdapter should have empty as true by default
statusReason: Error: Expected false to be true.

[Killed] LogicalOperator
src/app/v2/MatFormFieldAdapter.ts:58:12
 
   @HostBinding('class.floating')
   get shouldLabelFloat() {
-    return this.focused || !this.empty;
+    return this.focused && !this.empty;
   }
 
killedBy: MatFormFieldAdapter should float the label if it's being focused on
statusReason: Error: Expected false to be true.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:58:28
 
   @HostBinding('class.floating')
   get shouldLabelFloat() {
-    return this.focused || !this.empty;
+    return this.focused || this.empty;
   }
 
killedBy: MatFormFieldAdapter should have a shouldLabelFloat property and it should be false by default
statusReason: Error: Expected true to be false.

[Survived] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:61:23
     return this.focused || !this.empty;
   }
 
-  private _required = false;
+  private _required = true;
   @Input()
   get required() {

[NoCoverage] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:67:28
     return this._required;
   }
 
-  set required(isRequired) {
-    this._required = coerceBooleanProperty(isRequired);
-    this.stateChanges.next();
-  }
+  set required(isRequired) {}
 
   private _disabled = false;

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:72:23
     this.stateChanges.next();
   }
 
-  private _disabled = false;
+  private _disabled = true;
   @Input()
   get disabled(): boolean {
killedBy: MatFormFieldAdapter should have disabled as false by default
statusReason: Error: Expected true to be false.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:78:32
     return this._disabled;
   }
 
-  set disabled(value: boolean) {
-    this._disabled = coerceBooleanProperty(value);
-    this._disabled ? this.form.disable() : this.form.enable();
-    this.stateChanges.next();
-  }
+  set disabled(value: boolean) {}
 
   get errorState(): boolean {
killedBy: MatFormFieldAdapter should have it's disabled bound to form.disabled
statusReason: Error: Expected false to be true.

[Survived] StringLiteral
src/app/v2/MatFormFieldAdapter.ts:88:34
     return this.form.invalid;
   }
 
-  @Input() userAriaDescribedBy = '';
+  @Input() userAriaDescribedBy = "Stryker was here!";
 
   private focusMonitor: FocusMonitor;

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:107:5
       this.focusMonitor = injector.get(FocusMonitor);
       this.elementRef = injector.get(ElementRef);
     }
-    {
-      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(origin => {
-        this.focused = !!origin;
-        this.stateChanges.next();
-      });
-    }
+    {}
   }
 
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:108:64
       this.elementRef = injector.get(ElementRef);
     }
     {
-      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(origin => {
+      this.focusMonitor.monitor(this.elementRef.nativeElement, false).subscribe(origin => {
         this.focused = !!origin;
         this.stateChanges.next();
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:108:90
       this.elementRef = injector.get(ElementRef);
     }
     {
-      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(origin => {
-        this.focused = !!origin;
-        this.stateChanges.next();
-      });
+      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(origin => {});
     }
   }
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:109:24
     }
     {
       this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(origin => {
-        this.focused = !!origin;
+        this.focused = !origin;
         this.stateChanges.next();
       });
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[NoCoverage] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:115:42
     }
   }
 
-  setDescribedByIds(ids: string[]): void {
-    // todo(accessibility): ids returns an empty string it doesnt work
-    this.userAriaDescribedBy = ids.join(' ');
-  }
+  setDescribedByIds(ids: string[]): void {}
 
   abstract onContainerClickHook(): void;

[NoCoverage] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:121:39
   }
 
   abstract onContainerClickHook(): void;
-  onContainerClick(event: MouseEvent) {
-    // todo(high): implement the function
-    this.onContainerClickHook();
-  }
+  onContainerClick(event: MouseEvent) {}
 
   ngOnDestroy(): void {

[Survived] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:126:23
     this.onContainerClickHook();
   }
 
-  ngOnDestroy(): void {
-    this.focusMonitor.stopMonitoring(this.elementRef.nativeElement);
-    this.stateChanges.complete()
-  }
+  ngOnDestroy(): void {}
 }
 
