[NoCoverage] StringLiteral
app/v2/full-name-controller/full-name-controller.component.ts:28:56
     super(
       'full-name-controller',
       // todo(medium): create a factory for this
-      new FormControlAdapter(formBuilder.group({first: 'lol', last: ''})),
+      new FormControlAdapter(formBuilder.group({first: "", last: ''})),
       injector
     );

[NoCoverage] BlockStatement
app/v2/full-name-controller/full-name-controller.component.ts:33:20
     );
   }
 
-  ngOnInit(): void {
-    this.form.valueChanges.subscribe((value) => {
-      console.log(value)
-    })
-  }
+  ngOnInit(): void {}
 
 

[NoCoverage] BlockStatement
app/v2/full-name-controller/full-name-controller.component.ts:34:49
   }
 
   ngOnInit(): void {
-    this.form.valueChanges.subscribe((value) => {
-      console.log(value)
-    })
+    this.form.valueChanges.subscribe((value) => {})
   }
 
