[NoCoverage] BlockStatement
app/v2/full-name-controller/mixin.ts:4:11
 type Constructor<T = {}> = new (...args: any[]) => T;
 
 export function withExtend<T extends Constructor>(base: T = class {
-} as any) {
-  return class extends base {
-  };
-}
+} as any) {}
 
