[Killed] BlockStatement
shared/functions/isObjectEmpty/isObjectEmpty.func.ts:2:46
 export function isObjectEmpty(object: object) {
-  for (const value of Object.values(object)) {
-    if (!!value) {
-      return false
-    }
-  }
+  for (const value of Object.values(object)) {}
   return true;
 }
killedBy: isObjectEmpty should return false with object that has some values; MatFormFieldAdapter should have empty as false if value is not empty
statusReason: Error: Expected true to be false.
