[Survived] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:19:60
 
   private static createdCounter = 0;
 
-  private increaseNumberOfTimesThisClassHasCreated(): void {
-    MatFormFieldAdapter.createdCounter++;
-  }
+  private increaseNumberOfTimesThisClassHasCreated(): void {}
 
   @HostBinding() readonly id = `${this.controlType}-${MatFormFieldAdapter.createdCounter}`;

[Survived] UpdateOperator
src/app/v2/MatFormFieldAdapter.ts:20:5
   private static createdCounter = 0;
 
   private increaseNumberOfTimesThisClassHasCreated(): void {
-    MatFormFieldAdapter.createdCounter++;
+    MatFormFieldAdapter.createdCounter--;
   }
 

[Survived] StringLiteral
src/app/v2/MatFormFieldAdapter.ts:37:26
   }
 
   // todo(med): make placeholder accept objects instead of a string
-  private _placeholder = '';
+  private _placeholder = "Stryker was here!";
   @Input()
   get placeholder() {

[Killed] ConditionalExpression
src/app/v2/MatFormFieldAdapter.ts:56:12
 
   @HostBinding('class.floating')
   get shouldLabelFloat() {
-    return this.focused || !this.empty;
+    return false;
   }
 
killedBy: MatFormFieldAdapter should float the label if it's being focused on
statusReason: Error: Expected false to be true.

[Survived] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:60:23
   }
 
   // todo(med): make placeholder accept objects instead of a string
-  private _required = false;
+  private _required = true;
   @Input()
   get required() {

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:77:32
     return this._disabled;
   }
 
-  set disabled(value: boolean) {
-    this._disabled = coerceBooleanProperty(value);
-    setFormsDisableState.call(this);
-    this.stateChanges.next();
-
-    function setFormsDisableState(this: MatFormFieldAdapter<T>) {
-      this._disabled ? this.form.disable() : this.form.enable();
-    }
-  }
+  set disabled(value: boolean) {}
 
   get errorState(): boolean {
killedBy: MatFormFieldAdapter should have it's disabled bound to form.disabled
statusReason: Error: Expected false to be true.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:82:65
     setFormsDisableState.call(this);
     this.stateChanges.next();
 
-    function setFormsDisableState(this: MatFormFieldAdapter<T>) {
-      this._disabled ? this.form.disable() : this.form.enable();
-    }
+    function setFormsDisableState(this: MatFormFieldAdapter<T>) {}
   }
 
killedBy: MatFormFieldAdapter should have it's disabled bound to form.disabled
statusReason: Error: Expected false to be true.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:102:32
     public readonly formControlAdapter: FormControlAdapter,
     injector: Injector,
   ) {
-    const setNgControl = () => {
-      this.ngControl = injector.get(NgControl);
-    };
+    const setNgControl = () => {};
 
     setNgControl();
killedBy: MatFormFieldAdapter should create
statusReason: TypeError: Cannot set properties of undefined (setting 'valueAccessor')

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:112:56
     monitorIfElementIsBeingFocusedOn.call(this);
     this.increaseNumberOfTimesThisClassHasCreated();
 
-    const setFormControlAdapterAsValueAccessor = () => {
-      this.ngControl.valueAccessor = formControlAdapter;
-    };
+    const setFormControlAdapterAsValueAccessor = () => {};
 
     setFormControlAdapterAsValueAccessor.call(this);
killedBy: MatFormFieldAdapter should have ngControl with it's valueAccessor as FormControlAdapter
statusReason: Error: Expected instance of Function to be an instance of FormControlAdapter

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:119:60
     setFormControlAdapterAsValueAccessor.call(this);
 
 
-    function setFocusMonitor(this: MatFormFieldAdapter<T>) {
-      this.focusMonitor = injector.get(FocusMonitor);
-    }
+    function setFocusMonitor(this: MatFormFieldAdapter<T>) {}
 
     function setElementRef(this: MatFormFieldAdapter<T>) {
killedBy: MatFormFieldAdapter should create
statusReason: TypeError: Cannot read properties of undefined (reading 'monitor')

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:123:58
       this.focusMonitor = injector.get(FocusMonitor);
     }
 
-    function setElementRef(this: MatFormFieldAdapter<T>) {
-      this.elementRef = injector.get(ElementRef);
-    }
+    function setElementRef(this: MatFormFieldAdapter<T>) {}
 
     function monitorIfElementIsBeingFocusedOn(this: MatFormFieldAdapter<T>) {
killedBy: MatFormFieldAdapter should create
statusReason: TypeError: Cannot read properties of undefined (reading 'nativeElement')

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:127:77
       this.elementRef = injector.get(ElementRef);
     }
 
-    function monitorIfElementIsBeingFocusedOn(this: MatFormFieldAdapter<T>) {
-      const setFocusedAndChangeState = (value: FocusOrigin): void => {
-        this.focused = !!value;
-        this.stateChanges.next();
-      }
-
-      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(setFocusedAndChangeState);
-    }
+    function monitorIfElementIsBeingFocusedOn(this: MatFormFieldAdapter<T>) {}
   }
 
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BlockStatement
src/app/v2/MatFormFieldAdapter.ts:128:70
     }
 
     function monitorIfElementIsBeingFocusedOn(this: MatFormFieldAdapter<T>) {
-      const setFocusedAndChangeState = (value: FocusOrigin): void => {
-        this.focused = !!value;
-        this.stateChanges.next();
-      }
+      const setFocusedAndChangeState = (value: FocusOrigin): void => {}
 
       this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(setFocusedAndChangeState);
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:129:24
 
     function monitorIfElementIsBeingFocusedOn(this: MatFormFieldAdapter<T>) {
       const setFocusedAndChangeState = (value: FocusOrigin): void => {
-        this.focused = !!value;
+        this.focused = !value;
         this.stateChanges.next();
       }
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/v2/MatFormFieldAdapter.ts:133:64
         this.stateChanges.next();
       }
 
-      this.focusMonitor.monitor(this.elementRef.nativeElement, true).subscribe(setFocusedAndChangeState);
+      this.focusMonitor.monitor(this.elementRef.nativeElement, false).subscribe(setFocusedAndChangeState);
     }
   }
killedBy: MatFormFieldAdapter should change the focused state upon focusing on the control's DOM
statusReason: Error: Expected false to be truthy.

[NoCoverage] StringLiteral
src/app/v2/MatFormFieldAdapter.ts:139:41
 
   setDescribedByIds(ids: string[]): void {
     // todo(accessibility): ids returns an empty string it doesnt work
-    this.userAriaDescribedBy = ids.join(' ');
+    this.userAriaDescribedBy = ids.join("");
   }
 
